#ifndef __MY_EMOJIS_H__
#define __MY_EMOJIS_H__

const wchar_t *SMILEYS[] = { L"😎", L"😍", L"🥰", L"😭", L"😘", 
                             L"😒", L"😂", L"😘", L"😆", L"😁",
                             L"🤔", L"😅", L"😔", L"🙄", L"😜",
                             L"😒", L"😩", L"😊", L"😇", L"😌", 
                             L"😋", L"🤣", L"😉", L"😢", L"😱",
                             L"😀", L"😃", L"😄", L"🙂", L"🙃",
                             L"🤩", L"😗", L"😚", L"😙", L"😛", 
                             L"🤪", L"😝", L"🤑", L"🤗", L"🤭",
                             L"🤫", L"🤐", L"🤨", L"😐", L"😑",
                             L"😶", L"😏", L"😬", L"🤥", L"😪",
                             L"🤤", L"😴", L"😷", L"🤒", L"🤕",
                             L"🤢", L"🤮", L"🤧", L"🥵", L"🥶",
                             L"🥴", L"😵", L"🤯", L"🤠", L"🥳",
                             L"🤓", L"🧐", L"😕", L"😟", L"🙁",
                             L"😮", L"😯", L"😲", L"😳", L"🥺",
                             L"😦", L"😧", L"😨", L"😰", L"😥",
                             L"😖", L"😣", L"😞", L"😓", L"😫",
                             L"😤", L"😡", L"😠", L"🤬", L"😈",
                             L"👿" };

const wchar_t *FACES[] = { L"💩", L"🤡", L"👹", L"👺", L"👻",
                           L"👽", L"👾", L"🤖" };

const wchar_t *CATFACE[] = { L"😺", L"😸", L"😹", L"😻", L"😼",
                             L"😽", L"🙀", L"😿", L"😾" };
                            
const wchar_t *HEARTS[] = { L"💕", L"💔", L"💖", L"💞", L"💝", 
                            L"💓", L"💘", L"💗", L"💟", L"💌",
                            L"💙", L"💜", L"💚", L"💛", L"🧡", 
                            L"💜", L"🖤" };

const wchar_t *HANDS[] = { L"🙏", L"👍", L"👌", L"👏", L"✌", 
                           L"🙌", L"💪" };

const wchar_t *LOVE[] = { L"🔥", L"🌹", L"🌸" };

const wchar_t *PEOPLE[] = { L"🤷", L"🤦", L"💆" };

const wchar_t *HEAVEN[] = { L"🌞", L"🌚", L"🌝", L"🌛", L"🌜", 
                            L"🌬" };
 

#endif
